#+TITLE:     Git Bash Utils
#+AUTHOR:    Osiris Alejandro Gómez
#+EMAIL:     osiux@osiux.com
#+LANGUAGE:  en
#+LINK:      ISSUE https://github.com/osiris/git-bash-utils/issues/
#+LINK:      GIT https://github.com/osiris/git-bash-utils/commit/



** Releases
*** Release 0.1 [6/6]
**** DONE publish actual version of scripts
     CLOSED: [2014-09-24 mié 09:33]
     :LOGBOOK:
     - State "DONE"       from "NEXT"       [2014-09-24 mié 09:33]
     CLOCK: [2014-09-24 mié 08:54]--[2014-09-24 mié 09:32] =>  0:38
     :END:

**** DONE add =README.org=
     CLOSED: [2014-09-24 mié 10:00]
     :LOGBOOK:
     - State "DONE"       from "NEXT"       [2014-09-24 mié 10:00]
     CLOCK: [2014-09-24 mié 09:33]--[2014-09-24 mié 09:58] =>  0:25
     :END:

**** DONE supress stderror and better log
     CLOSED: [2014-09-28 dom 10:49]
     :LOGBOOK:
     - State "DONE"       from "NEXT"       [2014-09-28 dom 10:49]
     CLOCK: [2014-09-28 dom 10:23]--[2014-09-28 dom 10:48] =>  0:25
     :END:
**** DONE add clone, separe pull/push in git-update, fix today in git-streak
     CLOSED: [2014-10-06 lun 09:42]
     :LOGBOOK:
     - State "DONE"       from ""           [2014-10-06 lun 09:42]
     CLOCK: [2014-10-06 lun 09:00]--[2014-10-06 lun 09:40] =>  0:40
     :END:

**** DONE sum times in commits
     CLOSED: [2015-01-02 vie 19:55]
     :LOGBOOK:
     - State "DONE"       from "NEXT"       [2015-01-02 vie 19:55]
     CLOCK: [2015-01-02 vie 19:10]--[2015-01-02 vie 19:29] =>  0:19
     :END:

**** DONE filter git-repos
     CLOSED: [2015-01-02 vie 19:55]
     :LOGBOOK:
     - State "DONE"       from "NEXT"       [2015-01-02 vie 19:55]
     CLOCK: [2015-01-02 vie 19:30]--[2015-01-02 vie 19:53] =>  0:23
     :END:
